Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
Specifies how analytical model is being aligned in space

Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.Varies
Alignment types are different at each end.

Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.ManuallyAdjusted
Reports if analytical model has been manually adjusted, this value can only set internally by Revit.

Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.Projection
Manually set projections for analytical model using projection parameters.

Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod.AutoDetect
Auto-detect projections for analytical model.